Revit 2027 API
View.GetNonControlledTemplateParameterIds Method
 Returns a list of parameters that are not marked as included when this view is used as a template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetNonControlledTemplateParameterIds()
Public Function GetNonControlledTemplateParameterIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetNonControlledTemplateParameterIds()
member GetNonControlledTemplateParameterIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The parameter ids that are not marked to be included.
Remarks
 This is a subset of the parameters returned by GetTemplateParameterIds().
See Also
Reference
View Class
Autodesk.Revit.DB Namespace